examples/soap/soap-request.xml

<?xml version="1.0" encoding="UTF-8"?>

<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:brid="http://example.com/customer">

   <soapenv:Header/>

   <soapenv:Body>

      <brid:GetCustomerRequest>

         <brid:CustomerId>1001</brid:CustomerId>

      </brid:GetCustomerRequest>

   </soapenv:Body>

</soapenv:Envelope>